Revit 2024 API
BuiltInFailures.ConnectorFailures.MismatchNoAvailableConnector Property
 Cannot add [Element] to System. There is no available connector matching the System Type ([Type Name]) for the System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MismatchNoAvailableConnector { get; }
Visual Basic
Public Shared ReadOnly Property MismatchNoAvailableConnector As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MismatchNoAvailableConnector {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace